trunk/hbc-progetto-hypermedia-applications/app/controllers/designers_controller.rb

SELECT "designers".* FROM "designers" WHERE "designers"."top" = 't'
SELECT "designers".* FROM "designers"
---
  def index
    if(params[:top])
      @designers=Designer.where(:top=>true)
      @title="Top"
    else
      @designers=Designer.all

SELECT "designers".* FROM "designers" WHERE "designers"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @designer=Designer.find(params[:id])

SELECT "designers".* FROM "designers" WHERE "designers"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "products".* FROM "products" INNER JOIN "designers_products" ON "products"."id" = "designers_products"."product_id" WHERE "designers_products"."designer_id" = 1 ORDER BY name ASC
---
  def products
    @designer=Designer.find(params[:id])
    @products=@designer.products.order('name ASC')