trunk/hbc-progetto-hypermedia-applications/app/controllers/product_types_controller.rb

  def index
    @product_types=ProductType.all
---
SELECT "product_types".* FROM "product_types"