trunk/hbc-progetto-hypermedia-applications/app/controllers/shopfinders_controller.rb

SELECT "counties".* FROM "counties"
SELECT "regions".* FROM "regions"
---
  def index
      @counties=County.all
      @region=Region.all