trunk/hbc-progetto-hypermedia-applications/app/controllers/shopfinders_controller.rb

SELECT "countries".* FROM "countries"
SELECT "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT 1  [["id", "4"]]
SELECT "counties".* FROM "counties" WHERE "counties"."id" = ? LIMIT 1  [["id", "4"]]
SELECT "shops".* FROM "shops" WHERE (country= 'Italy' and county= 'Veneto')
---
  def index

      if(params[:country]&&params[:county])
        @countries=Country.all
        @country_chosen=Country.find(params[:country])
        @county_chosen=County.find(params[:county])
        @counties=County.where('country_id= :country', {
            :country => params[:country]
        })
        @shops=Shop.where('country= :country and county= :county', {
            :country => @country_chosen.name,
            :county => @county_chosen.name
        })