hbc-progetto-hypermedia-applications/app/controllers/products_controller.rb

  def index
    if(params[:product_type_id])
      @product_type=ProductType.find(params[:product_type_id])
      @products=Product.where(:product_type_id=>params[:product_type_id])
      @title=@product_type.name
    elsif(params[:must])
      @products=Product.where(:must_have=>true)
      @title="Must-have"
    elsif(params[:new])
      @products=Product.order('on_market_on DESC').limit(9)
      @title= "New"
    else
      @products=Product.all
---
SELECT "product_types".* FROM "product_types" WHERE "product_types"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "products".* FROM "products" WHERE "products"."product_type_id" = 1 LIMIT 1
SELECT "products".* FROM "products" WHERE "products"."must_have" = 't'
SELECT "products".* FROM "products" ORDER BY on_market_on DESC LIMIT 9
SELECT "products".* FROM "products"

  def show
    @product=Product.find(params[:id])
    @title=params[:title]
    if(params[:designer_id])
      @designer=Designer.find(params[:designer_id])
      @products=@designer.products
    end
    if(@title=="Must-have")
      @products=Product.where(:must_have=>true)
    elsif(@title=="New")
      @products=Product.order('on_market_on DESC').limit(9)
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "designers".* FROM "designers" WHERE "designers"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "products".* FROM "products" INNER JOIN "products_suggested_products" ON "products"."id" = "products_suggested_products"."suggested_product_id" WHERE "products_suggested_products"."product_id" = 1
SELECT "products".* FROM "products" ORDER BY on_market_on DESC LIMIT 9

  def datasheet
    @product=Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "25"]]

  def shops_for_this_product
    @product=Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]

  def photogallery
    @product=Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]