hbc-progetto-hypermedia-applications/app/controllers/product_types_controller.rb

SELECT "product_types".* FROM "product_types"
---
  def index
    @product_types=ProductType.all