hbc-progetto-hypermedia-applications/app/controllers/shops_controller.rb

SELECT "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @shop=Shop.find(params[:id])