hbc-progetto-hypermedia-applications/app/controllers/shopfinders_controller.rb

  def index
      @counties=County.all
      @country=Country.all
---
SELECT "counties".* FROM "counties" WHERE (country_id= '4')
SELECT "countries".* FROM "countries"