hbc-progetto-hypermedia-applications/app/views/shopfinders/index.html.erb


<% if(@shops!=nil) %>
        <br>
        <hr style="clear:both;"/>
        <br>
        <% i=1 %>
        <% @shops.each do |shop| %>
        <%= i %>) <%= link_to shop.name, shop_path(shop.id, :shopfinder=>true) %> (<%=shop.shop_type%>) <br>
---
SELECT "shops".* FROM "shops" WHERE (country= 'Italy' and county= 'Veneto')